Repository: Subeshan707/medexplain_ai
Catalog: lib/l10n/app_*.arb
Languages: ta

source: Settings
ta: அமைப்புகள்

source: Account
ta: கணக்கு

source: Appearance
ta: தோற்றம்

source: Preferences
ta: விருப்பங்கள்

# privacyAndSecurity
source: Privacy & Security
ta: தனியுரிமை & பாதுகாப்பு

source: About
ta: பற்றி

source: Dark Mode
ta: இருண்ட பயன்முறை

# darkModeSubtitle
source: Switch between light and dark theme
ta: வெளிர் மற்றும் இருண்ட தீம் இடையே மாற்றவும்

source: Language
ta: மொழி

source: Notifications
ta: அறிவிப்புகள்

source: Coming soon
ta: விரைவில் வரும்

source: Privacy Policy
ta: தனியுரிமைக் கொள்கை

source: Terms of Service
ta: சேவை விதிமுறைகள்

source: Clear Cache
ta: தற்காலிக சேமிப்பை அழி

# clearCacheSubtitle
source: Free up storage space
ta: சேமிப்பக இடத்தை விடுவிக்கவும்

# clearCacheConfirm
source: Clear Cache?
ta: தற்காலிக சேமிப்பை அழிக்கவா?

# clearCacheMessage
source: This will clear temporary files. Your saved data will not be affected.
ta: இது தற்காலிக கோப்புகளை அழிக்கும். உங்கள் சேமித்த தரவு பாதிக்கப்படாது.

# cacheCleared
source: Cache cleared successfully
ta: தற்காலிக சேமிப்பு வெற்றிகரமாக அழிக்கப்பட்டது

source: App Version
ta: பயன்பாட்டு பதிப்பு

source: Rate App
ta: பயன்பாட்டை மதிப்பிடுங்கள்

# rateAppSubtitle
source: Share your feedback on the store
ta: கடையில் உங்கள் கருத்தைப் பகிரவும்

source: Send Feedback
ta: கருத்து அனுப்பு

source: Open Source Licenses
ta: திறந்த மூல உரிமங்கள்

source: Sign Out
ta: வெளியேறு

# signOutConfirm
source: Sign Out?
ta: வெளியேறவா?

# signOutMessage
source: Are you sure you want to sign out?
ta: நீங்கள் நிச்சயமாக வெளியேற விரும்புகிறீர்களா?

source: Cancel
ta: ரத்து செய்

source: Patient
ta: நோயாளி

source: Clinician
ta: மருத்துவர்

# homeTitle
source: Simplify Your Medical Reports
ta: உங்கள் மருத்துவ அறிக்கைகளை எளிதாக்குங்கள்

# homeSubtitle
source: Upload or paste your medical report for an instant AI-powered explanation.
ta: உடனடி AI-இயக்கப்படும் விளக்கத்திற்கு உங்கள் மருத்துவ அறிக்கையை பதிவேற்றவும் அல்லது ஒட்டவும்.

source: Upload Report
ta: அறிக்கையைப் பதிவேற்றவும்

# uploadFiles
source: Upload Files (PDF, Images, TXT)
ta: கோப்புகளைப் பதிவேற்றவும் (PDF, படங்கள், TXT)

source: Processing...
ta: செயலாக்குகிறது...

# uploadHelper
source: Select one file or multiple images. PDFs and images support OCR.
ta: ஒரு கோப்பு அல்லது பல படங்களைத் தேர்ந்தெடுக்கவும். PDFs மற்றும் படங்கள் OCR ஆதரிக்கின்றன.

source: Paste Report Text
ta: அறிக்கை உரையை ஒட்டவும்

# pasteHint
source: Paste your medical report here...
ta: உங்கள் மருத்துவ அறிக்கையை இங்கே ஒட்டவும்...

source: Analyze Report
ta: அறிக்கையை பகுப்பாய்வு செய்

# safetyNotice
source: Your report is processed securely. No data is stored permanently.
ta: உங்கள் அறிக்கை பாதுகாப்பாக செயலாக்கப்படுகிறது. எந்த தரவும் நிரந்தரமாக சேமிக்கப்படவில்லை.

# pleaseEnterReport
source: Please enter or upload a medical report
ta: மருத்துவ அறிக்கையை உள்ளிடவும் அல்லது பதிவேற்றவும்

source: Analysis Results
ta: பகுப்பாய்வு முடிவுகள்

source: Critical findings detected
ta: முக்கியமான கண்டுபிடிப்புகள் கண்டறியப்பட்டன

source: New Analysis
ta: புதிய பகுப்பாய்வு

# noResults
source: No analysis results available
ta: பகுப்பாய்வு முடிவுகள் எதுவும் இல்லை

source: Summary
ta: சுருக்கம்

source: Overview
ta: கண்ணோட்டம்

source: What This Means
ta: இதன் பொருள் என்ன

source: Interpretation
ta: விளக்கம்

source: Ask Your Doctor
ta: உங்கள் மருத்துவரிடம் கேளுங்கள்

source: Suggested Questions
ta: பரிந்துரைக்கப்பட்ட கேள்விகள்

source: Clinical Findings
ta: மருத்துவ கண்டுபிடிப்புகள்

source: Key Observations
ta: முக்கிய அவதானிப்புகள்

source: Critical Values
ta: முக்கியமான மதிப்புகள்

source: Actionable Findings
ta: செயல்படக்கூடிய கண்டுபிடிப்புகள்

source: Considerations
ta: பரிசீலனைகள்

source: Recommendations
ta: பரிந்துரைகள்

source: References
ta: குறிப்புகள்

source: Sources
ta: ஆதாரங்கள்

source: Disclaimer
ta: பொறுப்புத் துறப்பு

# analyzingReport
source: Analyzing your report...
ta: உங்கள் அறிக்கையை பகுப்பாய்வு செய்கிறது...

# aiProcessing
source: Our AI is processing your medical document
ta: எங்கள் AI உங்கள் மருத்துவ ஆவணத்தை செயலாக்குகிறது

# extractingInfo
source: Extracting key information
ta: முக்கிய தகவல்களை பிரித்தெடுக்கிறது

# generatingExplanation
source: Generating easy-to-understand explanation
ta: எளிதில் புரிந்துகொள்ளக்கூடிய விளக்கத்தை உருவாக்குகிறது

# checkingRedFlags
source: Checking for important findings
ta: முக்கியமான கண்டுபிடிப்புகளை சரிபார்க்கிறது

# loginTitle
source: Welcome to
ta: வரவேற்கிறோம்

# loginSubtitle
source: Safe, AI-powered medical report explanations
ta: பாதுகாப்பான, AI-இயக்கப்படும் மருத்துவ அறிக்கை விளக்கங்கள்

source: Sign in with Google
ta: Google மூலம் உள்நுழையவும்

# selectRole
source: Select Your Role
ta: உங்கள் பாத்திரத்தைத் தேர்ந்தெடுக்கவும்

# selectRoleSubtitle
source: This helps us personalize your experience
ta: இது உங்கள் அனுபவத்தை தனிப்பயனாக்க உதவுகிறது

# iAmPatient
source: I am a Patient
ta: நான் ஒரு நோயாளி

# patientDesc
source: Get simple, easy-to-understand explanations of your medical reports
ta: உங்கள் மருத்துவ அறிக்கைகளின் எளிய, புரிந்துகொள்ள எளிதான விளக்கங்களைப் பெறுங்கள்

# iAmClinician
source: I am a Clinician
ta: நான் ஒரு மருத்துவர்

# clinicianDesc
source: Get detailed clinical analysis and professional insights
ta: விரிவான மருத்துவ பகுப்பாய்வு மற்றும் தொழில்முறை நுண்ணறிவுகளைப் பெறுங்கள்

source: Clinician Profile
ta: மருத்துவர் சுயவிவரம்

# setupProfessionalProfile
source: Set up your professional profile
ta: உங்கள் தொழில்முறை சுயவிவரத்தை அமைக்கவும்

source: Full Name
ta: முழு பெயர்

source: Clinic / Hospital Name
ta: மருத்துவமனை / மருத்துவமனை பெயர்

source: Specialty (Optional)
ta: சிறப்பு (விருப்பமானது)

source: Clinic Address (Optional)
ta: மருத்துவமனை முகவரி (விருப்பமானது)

source: Complete Setup
ta: அமைப்பை முடிக்கவும்

source: Required
ta: தேவை

source: Patient Profile
ta: நோயாளி சுயவிவரம்

# tellUsAboutYourself
source: Tell us a bit about yourself
ta: உங்களைப் பற்றி கொஞ்சம் சொல்லுங்கள்

source: Age
ta: வயது

source: Gender
ta: பாலினம்

source: Male
ta: ஆண்

source: Female
ta: பெண்

source: Other
ta: மற்றவை

source: Invalid age
ta: தவறான வயது

source: History
ta: வரலாறு

# historyComingSoon
source: Global History Coming Soon
ta: உலகளாவிய வரலாறு விரைவில் வரும்

source: History feature coming soon!
ta: வரலாறு அம்சம் விரைவில் வரும்!

source: Select Language
ta: மொழியைத் தேர்ந்தெடுக்கவும்

source: User
ta: பயனர்

# medicalDisclaimer
source: MEDICAL DISCLAIMER: This application provides informational explanations only and does NOT constitute medical advice, diagnosis, or treatment. Always consult with a qualified healthcare provider for medical decisions.
ta: மருத்துவ பொறுப்புத் துறப்பு: இந்த பயன்பாடு தகவல் விளக்கங்களை மட்டுமே வழங்குகிறது மற்றும் மருத்துவ ஆலோசனை, நோயறிதல் அல்லது சிகிச்சையை உருவாக்கவில்லை. மருத்துவ முடிவுகளுக்கு எப்போதும் தகுதிவாய்ந்த சுகாதார வழங்குநரை அணுகவும்.

# footerDisclaimer
source: Not medical advice â€¢ Consult your doctor
ta: மருத்துவ ஆலோசனை அல்ல • உங்கள் மருத்துவரை அணுகவும்

source: Error saving profile
ta: சுயவிவரத்தைச் சேமிப்பதில் பிழை

# exportedTo
source: Analysis exported to
ta: பகுப்பாய்வு ஏற்றுமதி செய்யப்பட்டது

source: Export failed
ta: ஏற்றுமதி தோல்வியடைந்தது

source: App store link coming soon!
ta: ஆப் ஸ்டோர் இணைப்பு விரைவில் வரும்!

source: Error loading profile
ta: சுயவிவரத்தை ஏற்றுவதில் பிழை
